Repository: Oakchris1955/Videomass
Catalog: videomass/data/locale/*/LC_MESSAGES/videomass.po
Languages: ru_ru

source: To suppress this message on startup, please install yt-dlp or disable it from the preferences.
ru_ru: Чтобы скрыть это сообщение при запуске, установите yt-dlp или отключите его в настройках.

source: Unexpected error while deleting file contents: {0}
ru_ru: Непредвиденная ошибка при удалении содержимого файла: {0}

source: Videomass supports mono and stereo audio channels. If you are not sure set to "Auto" and source values will be copied.
ru_ru: Videomass поддерживает моно и стерео аудиоканалы. Если вы не уверены, установите «Авто», исходные значения будут скопированы.

source: The audio Rate (or sample-rate) is the sound sampling frequency and is measured in Hertz. The higher the frequency, the more true it will be to the sound source and the more the file will increase in size. For audio CD playback, set a sampling frequency of 44100 kHz. If you are not sure, set to "Auto" and source values will be copied.
ru_ru: Частота дискретизации звука (или частота дискретизации) - это частота дискретизации звука, которая измеряется в герцах. Чем выше частота, тем более верным будет источник звука и тем больше будет увеличиваться размер файла. Для воспроизведения аудио CD установите частоту дискретизации 44100 кГц. Если вы не уверены, установите значение «Авто», и исходные значения будут скопированы.

source: The audio bitrate affects the file compression and thus the quality of listening. The higher the value, the higher the quality.
ru_ru: Битрейт звука влияет на сжатие файла и, следовательно, на качество прослушивания. Чем выше значение, тем выше качество.

source: Bit depth is the number of bits of information in each sample, and it directly corresponds to the resolution of each sample. Bit depth is only meaningful in reference to a PCM digital signal. Non-PCM formats, such as lossy compression formats, do not have associated bit depths.
ru_ru: Битовая глубина - это количество бит информации в каждом образце, и она напрямую соответствует разрешению каждого образца. Битовая глубина имеет значение только в отношении цифрового сигнала PCM. Форматы без PCM, такие как форматы сжатия с потерями, не имеют связанной битовой глубины.

source: When finished, once the operations have been completed successfully:
ru_ru: По завершении, как только операции будут успешно завершены:

source: Trash the source files
ru_ru: Удалить исходные файлы в корзину

source: Clear the File List
ru_ru: Очистить список файлов

source: Run
ru_ru: Запуск

source: Videomass - Batch Mode
ru_ru: Videomass - Пакетный режим

source: Source size: {0} x {1} pixels
ru_ru: Размер источника: {0} x {1} пикселей

source: Crop color
ru_ru: Цвет обрезки

source: Search for a specific frame
ru_ru: Поиск определенного кадра

source: Load
ru_ru: Загрузить

source: Cropping area selection
ru_ru: Выбор области обрезки

source: Height
ru_ru: Высота

source: Center
ru_ru: Центр

source: Width
ru_ru: Ширина

source: Reset
ru_ru: Сброс

source: Crop Tool
ru_ru: Инструмент обрезки

source: Choose the color to draw the cropping area
ru_ru: Выберите цвет, чтобы нарисовать область обрезки

source: Crop to width
ru_ru: Обрезать по ширине

source: Move vertically (set to -1 to center the vertical axis)
ru_ru: Перемещение по вертикали (установите значение -1 для центрирования вертикальной оси)

source: Move horizontally (set to -1 to center the horizontal axis)
ru_ru: Перемещение по горизонтали (установите значение -1, чтобы центрировать горизонтальную ось)

source: Crop to height
ru_ru: Обрезать по высоте

source: Advanced Options
ru_ru: Расширенные настройки

source: Deinterlace
ru_ru: Деинтерлейсинг

source: Interlace
ru_ru: Чересстрочная

source: Deinterlaces with w3fdif filter
ru_ru: Деинтерлейсинг с фильтром w3fdif

source: Deinterlaces with yadif filter
ru_ru: Деинтерлейсинг c фильтром 'yadif'

source: Interlaces with interlace filter
ru_ru: Чересстрочная с фильтром 'interlace'

source: Deinterlacing and Interlacing
ru_ru: Деинтерлейсинг(прогрессивная) и чересстрочная развёртка

source: Deinterlace the input video with `w3fdif` filter
ru_ru: Деинтерлейсинг входного видео с помощью фильтра `w3fdif`

source: Set the interlacing filter coefficients.
ru_ru: Устанавливает коэффициенты чересстрочного фильтра.

source: Specify which frames to deinterlace.
ru_ru: Укажите кадры для деинтерлейсинга.

source: Deinterlace the input video with `yadif` filter. Using FFmpeg, this is the best and fastest choice
ru_ru: Деинтерлейсируйте входное видео с помощью фильтра yadif. Используя FFmpeg, это лучший и самый быстрый выбор

source: mode The interlacing mode to adopt.
ru_ru: mode Используемый режим чересстрочной развертки.

source: parity The picture field parity assumed for the input interlaced video.
ru_ru: четность Предполагаемая четность поля изображения для входного чересстрочного видео.

source: Simple interlacing filter from progressive contents.
ru_ru: Простой фильтр с чересстрочной разверткой из прогрессивного содержимого.

source: scan: determines whether the interlaced frame is taken from the even (tff - default) or odd (bff) lines of the progressive frame.
ru_ru: scan: определяет, взят ли чересстрочный кадр из четных (tff - по умолчанию) или нечетных (bff) строк прогрессивного кадра.

source: lowpass: Enable (default) or disable the vertical lowpass filter to avoid twitter interlacing and reduce moire patterns. Default is no setting.
ru_ru: lowpass: Включите (по умолчанию) или отключите вертикальный фильтр нижних частот, чтобы избежать чересстрочной развертки твиттера и уменьшить муаровые узоры. По умолчанию настройка отсутствует.

source: Enable nlmeans denoiser
ru_ru: Включить фильтр nlmeans

source: nlmeans options
ru_ru: Параметры фильтра nlmeans

source: Enable hqdn3d denoiser
ru_ru: Включить фильтр hqdn3d

source: hqdn3d options
ru_ru: Параметры фильтра hqdn3d

source: Denoiser Tool
ru_ru: Инструмент Denoiser(шумоподавитель)

source: nlmeans: Denoise frames using Non-Local Means algorithm is capable of restoring video sequences, even with strong noise. It is ideal for enhancing the quality of old VHS tapes.
ru_ru: nlmeans: Удаление шума из кадров с использованием алгоритма нелокальных средств позволяет восстанавливать видеопоследовательности даже с сильным шумом. Он идеально подходит для улучшения качества старых кассет VHS.

source: hqdn3d: This is a high precision/quality 3d denoise filter. It aims to reduce image noise, producing smooth images and making still images really still. It should enhance compressibility.
ru_ru: hqdn3d: Это высокоточный и качественный трехмерный шумоподавляющий фильтр. Стремится уменьшить шум изображения, создать плавные изображения и сделать статическиеизображения неподвижными. Понятно, что это должно улучшить визуальное качество.

source: Read me
ru_ru: Прочти меня

source: View result
ru_ru: Посмотреть результат

source: New size in pixels
ru_ru: Новый размер в пикселях

source: Width:
ru_ru: Ширина:

source: Height:
ru_ru: Высота:

source: Constrain proportions (keep aspect ratio)
ru_ru: Сохраните пропорции (сохраните соотношение сторон)

source: Which dimension to adjust?
ru_ru: Какой размер отрегулировать?

source: Aspect Ratio
ru_ru: Пропорции

source: Setdar filter (display aspect ratio) example 16/9, 4/3
ru_ru: Setdar (соотношение сторон экрана)

source: Numerator
ru_ru: Числитель

source: Denominator
ru_ru: Знаменатель

source: Setsar filter (sample aspect ratio) example 1/1
ru_ru: SetSar(примерное соотношение сторон)

source: Resize Tool
ru_ru: Инструмент изменения размера

source: Scale filter, set to 0 to disable
ru_ru: Масштабный фильтр, установите 0, чтобы отключить

source: Display Aspect Ratio. Set to 0 to disable
ru_ru: Соотношение сторон дисплея. Установите 0, чтобы отключить

source: Sample (aka Pixel) Aspect Ratio. Set to 0 to disable
ru_ru: Образец (в пикселях) соотношения сторон. Установите 0, чтобы отключить

source: If you want to keep the aspect ratio, select "Constrain proportions" below and specify only one dimension, either width or height, and set the other dimension to -1 or -2 (some codecs require -2, so you should do some testing first).
ru_ru: Если вы хотите сохранить соотношение сторон, выберите «Сохранить пропорции» ниже и укажите только одно измерение, ширину или высоту, и установите для другого измерения значение -1 или -2 (для некоторых кодеков требуется -2, так что сначала вы должны провести некоторое тестирование)

source: Enable stabilizer
ru_ru: Включить stabilizer

source: Create a side-by-side comparison video
ru_ru: Создайте видео для параллельного сравнения

source: Create a snapshot
ru_ru: Создать снимок

source: Preview
ru_ru: Предпросмотр

source: Duration seconds:
ru_ru: Продолжительность секунд:

source: Video Detect
ru_ru: Обнаружение видео

source: [TRIPOD] Enable tripod mode if checked
ru_ru: [ШТАТИВ] Включите режим штатива, если установлен флажок

source: Video transform
ru_ru: Преобразование видео

source: [OPTALGO] optimization algorithm
ru_ru: [OPTALGO] алгоритм оптимизации

source: [CROP] Specify how to deal with borders at movement compensation
ru_ru: [ОБРЕЗАТЬ] Укажите, как работать с границами при компенсации движения

source: [INVERT] Invert transforms if checked
ru_ru: [ИНВЕРТИРОВАТЬ] Инвертировать преобразования, если отмечено

source: [RELATIVE] Consider transforms as relative to previous frame if checked, absolute if unchecked
ru_ru: [RELATIVE] Считать преобразования относительно предыдущего кадра, если отмечен; абсолютные, если не отмечен

source: Specify type of interpolation
ru_ru: Укажите тип интерполяции

source: [TRIPOD2] virtual tripod mode, equivalent to relative=unchecked:smoothing=0
ru_ru: [ШТАТИВ2] виртуальный режим штатива, эквивалентный relative=unchecked:smoothing=0

source: Unsharp filter:
ru_ru: Фильтр Нерезкость:

source: Seek to a position on the video.
ru_ru: Найти позицию на видео.

source: Make a snapshot of the video with the settings made.
ru_ru: Сделайте снимок видео со сделанными настройками.

source: Set the snapshot duration from 3 to 15 seconds from the seek position, default is 5 seconds.
ru_ru: Установите продолжительность снимка от 3 до 15 секунд от позиции поиска, по умолчанию 5 секунд.

source: Set how shaky the video is and how quick the camera is. A value of 1 means little shakiness, a value of 10 means strong shakiness. Default value is 5.
ru_ru: Установите, насколько тряским будет видео и насколько быстрая камера. Значение 1 означает небольшую неустойчивость, значение 10 означает сильную неустойчивость. Значение по умолчанию - 5.

source: Set the accuracy of the detection process. A value of 1 means low accuracy, a value of 15 means high accuracy. Default value is 15.
ru_ru: Установите точность процесса обнаружения. Значение 1 означает низкую точность, значение 15 означает высокую точность. Значение по умолчанию - 15.

source: Set stepsize of the search process. The region around minimum is scanned with 1 pixel resolution. Default value is 6.
ru_ru: Установите размер шага процесса поиска. Область около минимума сканируется с разрешением 1 пиксель. Значение по умолчанию - 6.

source: Set minimum contrast. Below this value a local measurement field is discarded. The range is 0-1. Default value is 0.25.
ru_ru: Установите минимальный контраст. Ниже этого значения локальное поле измерения отбрасывается. Диапазон 0-1. Значение по умолчанию - 0,25.

source: Set reference frame number for tripod mode. If enabled, the motion of the frames is compared to a reference frame in the filtered stream, identified by the specified number. The idea is to compensate all movements in a more-or-less static scene and keep the camera view absolutely still. The frames are counted starting from 1.
ru_ru: Установите номер опорного кадра для штатива режима. Если этот параметр включен, движение кадров сравнивается с опорным кадром в отфильтрованном потоке, идентифицируемым указанным номером. Идея состоит в том, чтобы компенсировать все движения в более или менее статичной сцене и сохранять неподвижность обзора камеры. Фреймы считаются начиная с 1.

source: Set the number of frames (value*2 + 1) used for lowpass filtering the camera movements. Default value is 15. For example a number of 10 means that 21 frames are used (10 in the past and 10 in the future) to smoothen the motion in the video. A larger value leads to a smoother video, but limits the acceleration of the camera (pan/tilt movements). 0 is a special case where a static camera is simulated.
ru_ru: Установите количество кадров (значение * 2 + 1), используемых для фильтрации нижних частот движений камеры. Значение по умолчанию - 15. Например, число 10 означает, что используется 21 кадр (10 в прошлом и 10 в будущем) для сглаживания движения в видео. Большее значение приводит к более плавному видео, но ограничивает ускорение камеры (движения панорамирования / наклона). 0 - это особый случай, когда моделируется статическая камера.

source: Set the camera path optimization algorithm. Values are: `gauss`: gaussian kernel low-pass filter on camera motion (default), and `avg`: averaging on transformations
ru_ru: Установите алгоритм оптимизации пути камеры. Значения: «gauss»: фильтр нижних частот ядра Гаусса при движении камеры (по умолчанию) и «avg»: усреднение при преобразованиях

source: Set maximal angle in radians (degree*PI/180) to rotate frames. Default value is -1, meaning no limit.
ru_ru: Установите максимальный угол в радианах (градусы * PI / 180) для поворота кадров. Значение по умолчанию -1, что означает отсутствие ограничений.

source: Specify how to deal with borders that may be visible due to movement compensation. Values are: `keep` keep image information from previous frame (default), `black` fill the border black
ru_ru: Укажите, как работать с границами, которые могут быть видны из-за компенсации движения. Возможные значения: «keep» сохранить информацию об изображении из предыдущего кадра (по умолчанию), «black» заполнить границу чёрным

source: Invert transforms if checked. Default is unchecked.
ru_ru: Инвертировать преобразования, если отмечено. По умолчанию флажок не установлен.

source: Consider transforms as relative to previous frame if checked, absolute if unchecked. Default is checked.
ru_ru: Считайте преобразования относительно предыдущего кадра, если отмечен, и абсолютными, если не отмечен. По умолчанию отмечен.

source: Set percentage to zoom. A positive value will result in a zoom-in effect, a negative value in a zoom-out effect. Default value is 0 (no zoom).
ru_ru: Установите процент для увеличения. Положительное значение приведет к эффекту увеличения, отрицательное значение - к эффекту уменьшения. Значение по умолчанию - 0 (без увеличения).

source: Set optimal zooming to avoid borders. Accepted values are: `0` disabled, `1` optimal static zoom value is determined (only very strong movements will lead to visible borders) (default), `2` optimal adaptive zoom value is determined (no borders will be visible), see zoomspeed. Note that the value given at zoom is added to the one calculated here.
ru_ru: Установите оптимальное масштабирование, чтобы избежать границ. Допустимые значения: «0» отключено, «1» определяется оптимальное значение статического масштабирования (только очень сильные движения приведут к видимым границам) (по умолчанию), «2» определяется оптимальное значение адаптивного масштабирования (границы не видны), см. zoomspeed. Обратите внимание, что значение, указанное при увеличении, добавляется к рассчитанному здесь.

source: Set percent to zoom maximally each frame (enabled when optzoom is set to 2). Range is from 0 to 5, default value is 0.25.
ru_ru: Установите процент для максимального увеличения каждого кадра (активируется, когда для optzoom установлено значение 2). Диапазон от 0 до 5, значение по умолчанию - 0,25.

source: Specify type of interpolation. Available values are: `no` no interpolation, `linear` linear only horizontal, `bilinear` linear in both directions (default), `bicubic` cubic in both directions (slow)
ru_ru: Укажите тип интерполяции. Доступные значения: «no» без интерполяции, «linear», линейный, только горизонтальный, «bilinear», линейный в обоих направлениях (по умолчанию), «bicubic», кубический в обоих направлениях (медленно).

source: Enable virtual tripod mode if checked, which is equivalent to relative=0:smoothing=0. Default is unchecked. Use also tripod option of vidstabdetect.
ru_ru: Включите режим виртуального штатива, если этот флажок установлен, что эквивалентно relative=0:smoothing=0. По умолчанию флажок не установлен. Используйте также вариант штатива в vidstabdetect.

source: Sharpen or blur the input video. Note the use of the unsharp filter which is always recommended.
ru_ru: Увеличьте резкость или размытие входного видео. Обратите внимание на использование нерезкого фильтра, который всегда рекомендуется.

source: Video Stabilizer Tool
ru_ru: Инструмент Video Stabilizer

source: Videomass - Loading...
ru_ru: Videomass - Загрузка...

source: Please wait, This process will take a few seconds.
ru_ru: Пожалуйста, подождите. Этот процесс займет несколько секунд.

source: Default position
ru_ru: Положение по умолчанию

source: Rotation setting
ru_ru: Настройка вращения

source: 90° (left)
ru_ru: 90° (влево)

source: 90° (right)
ru_ru: 90° (вправо)

source: Transpose Tool
ru_ru: Инструмент поворота кадра

source: Rotate 90 degrees right
ru_ru: Повернуть на 90 градусов вправо

source: Rotate 180 degrees
ru_ru: Повернуть на 180 градусов

source: Rotate 90 degrees left
ru_ru: Повернуть на 90 градусов влево

source: Please take a moment to set up the application
ru_ru: Пожалуйста, найдите время, чтобы настроить приложение

source: Click the "Next" button to get started
ru_ru: Нажмите кнопку "Следующий", чтобы начать

source: Welcome to the Videomass Wizard!
ru_ru: Добро пожаловать в Помощник Videomass!

source: Videomass is an application based on FFmpeg
ru_ru: Videomass - это приложение на основе FFmpeg

source: If FFmpeg is not on your computer, this application will be unusable
ru_ru: Если FFmpeg отсутствует на вашем компьютере, это приложение будет невозможно использовать

source: If you have already installed FFmpeg on your operating system, click the "Auto-detection" button.
ru_ru: Если вы уже установили FFmpeg в своей операционной системе, щелкните кнопку "Автоопределение".

source: If you want to use a version of FFmpeg located on your filesystem but not installed on your operating system, click the "Locate" button.
ru_ru: Если вы хотите использовать версию FFmpeg, которая находится в вашей файловой системе, но не установлена ​​в вашей операционной системе, нажмите кнопку "Найти".

source: Auto-detection
ru_ru: Автоматическое определение

source: Locate
ru_ru: Найдите

source: Click the "Next" button
ru_ru: Нажмите кнопку "Далее"

source: '{}' is not installed on your computer. Install it or indicate another location by clicking the 'Locate' button.
ru_ru: '{}' не установлен на вашем компьютере. Установите его или укажите другое место, нажав кнопку 'Найти'.

source: Videomass already seems to include FFmpeg. Do you want to use that?
ru_ru: Videomass кажется уже включает FFmpeg. Вы хотите использовать это?

source: Please confirm
ru_ru: Пожалуйста, подтвердите

source: Locating FFmpeg executables
ru_ru: Поиск исполняемых файлов FFmpeg

source: "ffmpeg", "ffprobe" and "ffplay" are required. Complete all the text boxes below by clicking on the respective buttons.
ru_ru: "ffmpeg", "ffprobe" и "ffplay" обязательны. Заполните все текстовые поля ниже, нажав соответствующие кнопки.

source: {} location
ru_ru: {} исполняемый файл

source: Videomass has a simple graphical interface for yt-dlp
ru_ru: Videomass имеет простой графический интерфейс для yt-dlp

source: This feature allows you to download video and audio from many sites, including YouTube.com and even Facebook.
ru_ru: Эта функция позволяет загружать видео и аудио из многих сайтов, включая YouTube.com и даже Facebook.

source: Do you want to enable this feature?
ru_ru: Вы хотите включить эту функцию?

source: Wizard completed successfully!
ru_ru: Помощник успешно завершен!

source: Remember that you can always change these settings later, through the Preferences dialog.
ru_ru: Помните, что вы всегда можете изменить эти настройки позже через диалоговое окно «Настройки».

source: Thank You!
ru_ru: Благодарю вас!

source: To exit click the "Finish" button
ru_ru: Для выхода нажмите кнопку "Завершено"

source: < Previous
ru_ru: < Предыдущий

source: Next >
ru_ru: Следующий >

source: Videomass Wizard
ru_ru: Videomass Помощник

source: Finish
ru_ru: Завершено

source: Some text boxes are still incomplete
ru_ru: Некоторые текстовые поля все еще не заполнены

source: Re-start is required
ru_ru: Требуется перезапуск

source: Done!
ru_ru: Выполнено!

source: Cross-platform graphical user interface for FFmpeg and yt-dlp.
ru_ru: Кроссплатформенный графический пользовательский интерфейс для FFmpeg и yt-dlp.

source: One-Pass, Do not start with `ffmpeg -i filename`; do not end with `output-filename`
ru_ru: Первый проход, Не начинайте с: `ffmpeg -i filename`; не заканчивайте `output-filename`

source: Two-Pass (optional), Do not start with `ffmpeg -i filename`; do not end with `output-filename`
ru_ru: Второй проход (по желанию), Не начинайте с `ffmpeg -i filename`; не заканчивайте `output-filename`

source: Supported Formats list (optional). Do not include the `.`
ru_ru: Список поддерживаемых форматов (необязательно). Не указывать точку `.`

source: Output Format. Empty to copy format and codec. Do not include the `.`
ru_ru: Выходной формат. Пусто для копирования формата и кодека. Не указывать точку `.`

source: Profile Name
ru_ru: Имя профиля

source: Description
ru_ru: Описание

source: Pre-input arguments for One-Pass (optional)
ru_ru: Аргументы предварительного ввода для One-Pass (необязательно)

source: Pre-input arguments for Two-Pass (optional)
ru_ru: Аргументы предварительного ввода для двухпроходного режима (необязательно)

source: A short profile name
ru_ru: Краткое имя профиля

source: A long description of the profile
ru_ru: Подробное описание профиля

source: FFmpeg arguments for one-pass encoding
ru_ru: Аргументы FFmpeg для однопроходного кодирования

source: FFmpeg arguments for two-pass encoding
ru_ru: Аргументы FFmpeg для двухпроходного кодирования

source: One or more comma-separated format names that are not compatible with this profile.
ru_ru: Одно или несколько названий форматов, разделенных запятыми, которые несовместимы с этим профилем.

source: Output format extension. Leave empty to copy codec and format
ru_ru: Расширение формата вывода. Оставьте пустым, чтобы скопировать кодек и формат

source: Any optional arguments to add before input file on the one-pass encoding, e.g required names of some hardware accelerations like -hwaccel to use with CUDA.
ru_ru: Любые необязательные аргументы, добавляемые перед входным файлом при однопроходном кодировании, например, обязательные имена некоторых аппаратных ускорений, таких как -hwaccel, для использования с CUDA.

source: Any optional arguments to add before input file on the two-pass encoding, e.g required names of some hardware accelerations like -hwaccel to use with CUDA.
ru_ru: Любые необязательные аргументы, добавляемые перед входным файлом при двухпроходном кодировании, например, обязательные имена некоторых аппаратных ускорений, таких как -hwaccel, для использования с CUDA.

source: Incomplete profile assignments
ru_ru: Неполные данные профиля

source: Videomass - Warning!
ru_ru: Videomass - Предупреждение!

source: Formats must be comma-separated
ru_ru: Форматы должны быть разделены запятыми

source: Profile already stored with same name
ru_ru: Профиль с таким именем уже сохранен

source: Font Size
ru_ru: Размер шрифта

source: Font Color
ru_ru: Цвет шрифта

source: Shadow Color
ru_ru: Цвет тени
