Repository: Oakchris1955/Videomass
Catalog: videomass/data/locale/*/LC_MESSAGES/videomass.po
Languages: ru_ru

source: Time to spend encoding. "good" is the default and recommended for most applications; "best" is recommended if you have lots of time and want the best compression efficiency; "realtime" is recommended for live / fast encoding.
ru_ru: Время заняться кодированием. "good" используется по умолчанию и рекомендуется для большинства приложений; "best" рекомендуется, если у вас много времени и вам нужна максимальная эффективность сжатия; "realtime" рекомендуется для живого/быстрого кодирования.

source: If enabled, adds support for row based multithreading which greatly enhances the number of threads the encoder can utilise. This improves encoding speed significantly on systems that are otherwise underutilised when encoding VP9. Since the amount of additional threads depends on the number of "tiles", which itself depends on the video resolution, encoding higher resolution videos will see a larger performance improvement.
ru_ru: Если этот параметр включен, добавляется поддержка многопоточности на основе строк, что значительно увеличивает количество потоков, которые может использовать кодер. Это значительно повышает скорость кодирования в системах, которые в противном случае недостаточно используются при кодировании VP9. Поскольку количество дополнительных потоков зависит от количества «плиток», которое в свою очередь зависит от разрешения видео, кодирование видео с более высоким разрешением приведет к большему повышению производительности.

source: Subtitle Mapping
ru_ru: Сопоставление субтитров

source: Copy Chapters
ru_ru: Копировать главы

source: Copy Metadata
ru_ru: Копировать метаданные

source: Select "All" to include any source file subtitles in the output video. Select "None" to exclude any subtitles stream in the output video. This option is automatically ignored for output audio files.
ru_ru: Выберите «Все», чтобы включить любые субтитры исходного файла в выходное видео. Выберите «Нет», чтобы исключить любой поток субтитров из выходного видео. Эта опция автоматически игнорируется для выходных аудиофайлов.

source: Copy the chapter markers as is from source file. This option is automatically ignored for output audio files.
ru_ru: Скопируйте маркеры глав как есть из исходного файла. Эта опция автоматически игнорируется для выходных аудиофайлов.

source: Copy all incoming metadata from source file, such as audio/video tags, titles, unique marks, and so on.
ru_ru: Скопируйте все входящие метаданные из исходного файла, такие как теги аудио/видео, заголовки, уникальные метки и т. д.

source: Additional options
ru_ru: Дополнительные опции

source: Welcome to Videomass
ru_ru: Добро пожаловать в Videomass

source: Version {}
ru_ru: Версия {}

source: Presets Manager
ru_ru: Менеджер Пресетов

source: AV-Conversions
ru_ru: AV-конвертация

source: Concatenate media files
ru_ru: Объединить медиафайлы

source: From Movie to Pictures
ru_ru: Картинки из фильма

source: Create, edit and use quickly your favorite FFmpeg presets and profiles with full formats support and codecs.
ru_ru: Cоздавайте, редактируйте или используйте свои любимые пресеты и профили прямо сейчас с полной поддержкой форматов и кодеков FFmpeg.

source: A set of useful tools for audio and video conversions. Save your profiles and reuse them with Presets Manager.
ru_ru: Набор полезных инструментов для преобразования аудио и видео. Сохраните свои профили и повторно используйте их с помощью Менеджера Пресетов.

source: Easily download videos and audio in different formats and quality from YouTube, Facebook and more sites.
ru_ru: Легко загружайте видео и аудио в различном формате и качестве с YouTube, Facebook и других сайтов.

source: Concatenate multiple media files based on import order without re-encoding
ru_ru: Объединение нескольких медиафайлов в соответствии с порядком импорта без перекодирования

source: Create video from a sequence of images, based on import order, with the ability to add an audio file.
ru_ru: Создавайте видео из последовательности изображений, основываясь на порядке импорта, с возможностью добавления аудиофайла.

source: Extract images (frames) from your movies in JPG, PNG, BMP, GIF formats.
ru_ru: Извлекайте изображения (кадры) из ваших фильмов в форматы JPG, PNG, BMP, GIF.

source: At least two files are required to perform concatenation.
ru_ru: Для объединения требуются как минимум два файла.

source: Invalid data found
ru_ru: Обнаружены неверные данные

source: The files do not have the same "codec_types", same "sample_rate" or same "width" or "height". Unable to proceed.
ru_ru: Файлы не имеют одинаковых «codec_types», «sample_rate» или одинаковых «ширины» или «высоты». Невозможно продолжить.

source: - The concatenation function is performed only with Audio files or only with Video files. - The order of concatenation depends on the order in which the files were added. - The output file name will have the same name as the first file added (also depends on the settings made in the preferences dialog or the renaming functions used). - Video files must have exactly same streams, same codecs and same width/height, but can be wrapped in different container formats. - Audio files must have exactly the same formats, same codecs with equal sample rate.
ru_ru: - Функция конкатенации(последовательного соединения) выполняется только с аудиофайлами или только с видеофайлами. - Порядок объединения зависит от порядка добавления файлов. - Имя выходного файла будет таким же, как у первого добавленного файла (также зависит от настроек, сделанных в диалоговом окне настроек, или от используемых функций переименования). - Видеофайлы должны иметь одинаковые потоки, одинаковые кодеки и одинаковые ширину/высоту, но может быть упакован в разные форматы контейнеров. - Аудиофайлы должны иметь одинаковые форматы, одинаковые кодеки с одинаковой частотой дискретизации.

source: For more details, see the Videomass User Guide:
ru_ru: Подробнее см. Руководство пользователя Videomass:

source: For more information, visit the official FFmpeg documentation:
ru_ru: Для получения дополнительной информации посетите официальную документацию FFmpeg:

source: Items to concatenate File destination Output Format Output multimedia type Duration
ru_ru: Элементы для объединения Место назначения файла Выходной формат Тип вывода мультимедиа Продолжительность

source: File has illegal characters like:
ru_ru: Файл содержит недопустимые символы, такие как:

source: Invalid character found in path name: (")
ru_ru: В имени пути обнаружен недопустимый символ: (")

source: Directories are not allowed, just add files, please.
ru_ru: Каталоги не разрешены, добавьте просто файлы.

source: File without format extension: please give an appropriate extension to the file name, example '.mkv', '.avi', '.mp3', etc.
ru_ru: Файл без расширения формата: укажите соответствующее расширение имени файла, например «.mkv», «.avi», «.mp3» и т.д.

source: Name has illegal characters like: {0}
ru_ru: Имя содержит недопустимые символы, такие как: {0}

source: Name already in use:
ru_ru: Имя уже используется:

source: Duplicate file, it has already been added to the list.
ru_ru: Дублирующий файл, он уже добавлен в список.

source: Rejected files
ru_ru: Отклоненные файлы

source: Source file
ru_ru: Исходный файл

source: Duration
ru_ru: Длина

source: Media type
ru_ru: Тип медиа

source: Size
ru_ru: Размер

source: Drag one or more files below
ru_ru: Перетащите один или несколько файлов ниже

source: Save to:
ru_ru: Сохранить в:

source: Set a new destination folder for encodings
ru_ru: Установите новую папку назначения для кодировок

source: Encodings destination folder
ru_ru: Папка назначения кодировок

source: Play file
ru_ru: Воспроизвести файл

source: Drag two or more Audio/Video files below
ru_ru: Перетащите два (или более) аудио/видео файла в поле ниже

source: Drag one or more Image files below
ru_ru: Перетащите один или несколько файлов изображений ниже

source: Drag one or more Video files below
ru_ru: Перетащите один или несколько видеофайлов ниже

source: Rename the file destination
ru_ru: Переименуйте место назначения файла

source: Rename the selected file to:
ru_ru: Переименуйте выбранный файл в:

source: Add Files
ru_ru: Добавить файлы

source: Rename the {0} items to:
ru_ru: Файлов для переименования: {0}

source: New Name #
ru_ru: Новое имя #

source: Sorry, all task failed !
ru_ru: Извините, задача не выполнена !

source: The process was stopped due to a fatal error.
ru_ru: Процесс был остановлен из-за фатальной ошибки.

source: Interrupted Process !
ru_ru: Процесс прерван !

source: Successfully completed !
ru_ru: Успешно завершено !

source: Not everything was successful.
ru_ru: Завершено, но не все прошло хорошо.

source: Encoding Status
ru_ru: Статус кодирования

source: Fatal Error !
ru_ru: Фатальная ошибка !

source: Get your files at the destination you specified
ru_ru: Получите ваши файлы по указанному вами адресу

source: For more details please read the Current Log.
ru_ru: Для получения более подробной информации, пожалуйста, прочтите текущий журнал.

source: ...Finished
ru_ru: ...Завершено

source: Please wait... interruption in progress
ru_ru: Пожалуйста, подождите... происходит прерывание

source: ...Interrupted
ru_ru: ...Прервано

source: Presets
ru_ru: Пресеты

source: Delete
ru_ru: Удалить

source: Duplicate
ru_ru: Дублировать

source: Profiles
ru_ru: Профили

source: One-Pass Encoding
ru_ru: Однопроходное кодирование

source: Two-Pass Encoding
ru_ru: Двухпроходное кодирование

source: Choose a preset and view its profiles
ru_ru: Выберите пресет и просмотрите его профили

source: Delete the selected profile
ru_ru: Удалить выбранный профиль

source: Edit the selected profile
ru_ru: Редактировать выбранный профиль

source: Name
ru_ru: Имя

source: Output Format
ru_ru: Выходной формат

source: Supported Format List
ru_ru: Список поддерживаемых форматов

source: Cannot save current data in file '{}'.
ru_ru: Невозможно сохранить текущие данные в файл '{}'.

source: Are you sure you want to remove "{}" preset? It will be moved to the "Removals" subfolder inside the presets folder.
ru_ru: Вы уверены, что хотите удалить пресет "{}" ? Он будет перемещен в подпапку «Удалённые» внутри папки пресетов.

source: {} Sorry, removal failed, cannot continue..
ru_ru: {} Извините, удаление не получилось, продолжение невозможно.

source: The preset "{0}" was successfully removed
ru_ru: Пресет "{0}" был успешно удален

source: A file with this name already exists, do you want to overwrite it?
ru_ru: Файл с таким именем уже существует. Вы хотите его перезаписать?

source: This preset already exists and is about to be updated. Don't worry, it will keep all your saved profiles. Do you want to continue?
ru_ru: Этот пресет уже существует и скоро будет обновлен. Не волнуйтесь, все ваши профили будут сохранены. Вы хотите продолжить?

source: This will update the presets database. Don't worry, it will keep all your saved profiles. Do you want to continue?
ru_ru: Это обновит базу пресетов. Не волнуйтесь, все ваши сохраненные профили не пропадут. Вы хотите продолжить?

source: The presets database has been successfully updated
ru_ru: База данных пресетов успешно обновлена

source: Be careful! The selected preset will be overwritten with the default one. Your profiles may be deleted! Do you want to continue?
ru_ru: Быть осторожен! Выбранный пресет будет заменен пресетом по умолчанию. Ваши профили могут быть удалены! Вы хотите продолжить?

source: Successful recovery
ru_ru: Успешное восстановление

source: Be careful! This action will restore all presets to default ones. Your profiles may be deleted! In any case, to avoid data loss, the presets folder will be backed up in the program's configuration directory. Do you want to continue?
ru_ru: Будь осторожен! Это действие вернет все пресеты к значениям по умолчанию. Ваши профили могут быть удалены! В любом случае, во избежание потери данных, папка пресетов будет скопирована в каталог конфигурации программы. Вы хотите продолжать?

source: Are you sure you want to delete the selected profile? It will no longer be possible to recover it.
ru_ru: Вы уверены, что хотите удалить выбранный профиль? Восстановить его уже не удастся.

source: First select a profile in the list
ru_ru: Вы должны выбрать профиль в списке

source: The selected profile command has been changed manually. Do you want to apply it during the conversion process?
ru_ru: Управление выбранным профилем изменено вручную. Вы хотите применить его в процессе конвертации?

source: Don't show this dialog again
ru_ru: Больше не показывать этот диалог

source: Batch processing items Destination Automation/Preset Encoding passes Profile Used Output Format Start of segment Clip duration
ru_ru: Пакетная обработка элементов Место назначения Автоматизация/Пресет Encoding passes Используемый профиль Выходной формат Начало сегмента Продолжительность клипа

source: Images need to be resized, please use Resize function.
ru_ru: Размер изображений необходимо изменить, воспользуйтесь функцией изменения размера.

source: 1. Import one or more image files such as JPG, PNG and BMP formats, then select one. 2. Use the Resize tool for images which have different sizes such as width and height. It is optional in other cases. 3. Use the Timeline editor (CTRL+T) to set the time interval between images by adjusting the "End" duration value and leaving the "Start" value at 00:00:00.000. 4. Run the conversion. The produced video will have the name of the selected file in the 'File List' panel, which will be saved in a folder named 'Still_Images' with a progressive digit, in the path you specify.
ru_ru: 1. Импортируйте один или несколько файлов изображений, таких как форматы JPG, PNG и BMP, а затем выберите один. 2. Используйте инструмент «Изменить размер» для изображений, которые имеют разные размеры, например ширину и высоту. В других случаях это необязательно. 3. Используйте редактор временной шкалы (CTRL+T), чтобы установить временной интервал между изображениями, отрегулировав значение продолжительности «Конец» и оставив значение «Начало» равным 00:00:00.000. 4. Запустите преобразование. Созданное видео будет иметь имя выбранного файла на панели «Список файлов», которое\n будут сохранены в папке с именем «Still_Images» с прогрессивной цифрой по указанному вами пути.

source: Enable a single still image
ru_ru: Включить одно неподвижное изображение

source: Force original aspect ratio using padding rather than stretching
ru_ru: Принудительно использовать исходное соотношение сторон, используя отступы, а не растяжение

source: Include audio file
ru_ru: Включить аудиофайл

source: Play the video until audio track finishes
ru_ru: Воспроизведение видео до окончания звуковой дорожки(трека)

source: Open audio file
ru_ru: Открыть аудиофайл

source: Additional arguments
ru_ru: Дополнительные аргументы

source: Open Audio File
ru_ru: Открыть аудиофайл

source: Invalid file: '{}' {}
ru_ru: Неверный файл: '{}' {}

source: Invalid file: '{}' It doesn't appear to be an audio file.
ru_ru: Неверный файл: '{}' Похоже, это не аудиофайл.

source: Invalid file: '{}'
ru_ru: Недопустимый файл: '{}'

source: Unsupported format '{}'
ru_ru: Неподдерживаемый формат '{}'

source: File does not exist: "{}"
ru_ru: Файл не существует: "{}"

source: ERROR
ru_ru: ОШИБКА

source: Items to concatenate Output filename Destination Output Format Additional arguments Audio file Shortest Resize Pre-input Frame per Second (FPS) Still image duration Overall video duration
ru_ru: Элементы для объединения Имя выходного файла Место назначения Выходной формат Дополнительные аргументы Аудио файл Кратко Изменить размер Предварительный ввод Кадров в секунду(FPS) Продолжительность неподвижного изображения Общая продолжительность видео

source: 1. Import one or more video files, then select one. 2. To select a slice of time use the Timeline editor (CTRL+T) by adjusting the "End" and the "Start" duration values. 3. Select an output format (jpg, png, bmp). 4. Start the conversion. The images produced will be saved in a folder named 'Movie_to_Pictures' with a progressive digit, in the path you specify.
ru_ru: 1. Импортируйте один или несколько видеофайлов, затем выберите один. 2. Чтобы выбрать отрезок времени, используйте редактор Timeline (CTRL+T), отрегулировав Значения длительности «Конец» и «Начало». 3. Выберите выходной формат (jpg, png, bmp). 4. Запустите преобразование. Созданные изображения будут сохранены в папке с именем 'Movie_to_Pictures' с прогрессивной цифрой по указанному вами пути.

source: Create thumbnails
ru_ru: Создание эскизов

source: Create tiled mosaics
ru_ru: Создание мозаики из плиток

source: Create animated GIF
ru_ru: Создать анимированный GIF

source: Options
ru_ru: Параметры

source: Output format:
ru_ru: Выходной формат:

source: Rows:
ru_ru: Ряды:

source: Columns:
ru_ru: Столбцы:

source: Other unofficial resources:
ru_ru: Другие неофициальные ресурсы:

source: Set FPS control from 0.1 to 30.0 fps. The higher this value, the more images will be extracted.
ru_ru: Установите контроль FPS от 0,1 до 30,0 кадров в секунду. Чем выше это значение, тем больше изображений будет извлечено.

source: Spaces around the mosaic tiles. From 0 to 32 pixels
ru_ru: Пространства вокруг мозаичных плиток. От 0 до 32 пикселей

source: Spaces around the mosaic borders. From 0 to 32 pixels
ru_ru: Пространства вокруг границ мозаики. От 0 до 32 пикселей

source: Selected File Output Format Destination Rate (fps) Resizing Mosaic rows Mosaic columns Mosaic padding Mosaic margin Custom Arguments Start of segment Duration
ru_ru: Выбранный файл Выходной формат Папка назначения Скорость (кадров в секунду) Изменение размера Мозаичных рядов Мозаичных колонок Mosaic padding Mosaic margin Пользовательские аргументы Начало сегмента Продолжительность

source: At least one "Format Code" must be checked for each URL selected in green.
ru_ru: По крайней мере один " Код формата " должен быть проверен для каждого URL, выделенного зеленым цветом.

source: Format Code
ru_ru: Код формата

source: Title
ru_ru: Название

source: Extension
ru_ru: Расширение

source: Resolution
ru_ru: Разрешение

source: Video Codec
ru_ru: Кодек видео

source: Audio Codec
ru_ru: Кодек аудио

source: Don't merge any files
ru_ru: Не объединять никакие файлы

source: Download only the best selected qualities
ru_ru: Скачивайте только лучшие отобранные качества

source: ERROR: Unable to get format codes. Unsupported URL: '{0}'
ru_ru: ОШИБКА: Не удается получить коды формата. Неподдерживаемый URL-адрес: '{0}'

source: [Videomass]: SUCCESS !
ru_ru: [Videomass]: УСПЕШНО !

source: [Videomass]: FAILED !
ru_ru: [Videomass]: НЕ УДАЛОСЬ !

source: Download Status
ru_ru: Статус загрузки

source: Check the current output or read the related log file for more information.
ru_ru: Проверьте текущий вывод или прочтите соответствующий файл журнала для получения дополнительной информации.

source: Done
ru_ru: Готово

source: Do you want to close the active view keeping the data in memory and any background processes?
ru_ru: Вы хотите закрыть активное окно, сохранив данные в памяти и любые фоновые процессы?

source: Are you sure you want to exit this window? All data will be lost
ru_ru: Вы уверены, что хотите закрыть это окно? Все данные будут потеряны

source: Quit YouTube Downloader?
ru_ru: Выйти из YouTube Downloader?

source: Open destination folder of downloads Ctrl+D
ru_ru: Открыть папку назначения загрузок Ctrl+D

source: Close view Ctrl+W
ru_ru: Закрыть(скрыть) окно Ctrl+W

source: Close the active view keeping the data in memory and any background processes
ru_ru: Закройте активное окно, сохранив данные в памяти и все фоновые процессы

source: Quit YouTube Downloader Ctrl+Q
ru_ru: Выйти из YouTube Downloader Ctrl+Q

source: Exit the window by deleting all data in memory
ru_ru: Закрыть окно, удалив все данные в памяти

source: Paste Ctrl+V
ru_ru: Вставить Ctrl+V

source: Paste the copied URLs to clipboard
ru_ru: Вставьте скопированные URL-адреса в буфер обмена

source: Remove selected URL DEL
ru_ru: Удалить выбранный URL DEL

source: Remove the selected URL from the list
ru_ru: Удалить выбранный URL из списка

source: Clear the URL list
ru_ru: Очистить список URL

source: Version of yt-dlp
ru_ru: Версия yt-dlp

source: Shows the version in use
ru_ru: Показывает используемую версию

source: Latest version of yt-dlp
ru_ru: Последняя версия yt-dlp

source: Check the latest version available on github.com
ru_ru: Проверьте последнюю версию, доступную на github.com

source: You are using "yt-dlp" version {0}
ru_ru: Вы используете версию "yt-dlp" {0}

source: "yt-dlp": Latest version available: {0}
ru_ru: "yt-dlp": Доступна последняя версия:{0}

source: Go to the previous panel
ru_ru: Перейти к предыдущей панели

source: Go to the next panel
ru_ru: Перейти к следующей панели

source: Shows statistics and information
ru_ru: Показать статистику и информацию

source: Statistics
ru_ru: Статистика

source: Start downloading
ru_ru: Начать загрузку

source: Download
ru_ru: Скачать

source: Videomass - List of URLs
ru_ru: Videomass - Список URL-адресов

source: Viewing last log
ru_ru: Просмотр последнего log-журнала

source: Videomass - Downloader Message Monitoring
ru_ru: Videomass - Мониторинг сообщений загрузчика

source: Playlist Items
ru_ru: Элементы плейлиста

source: To index the media of a playlist, click on the "Playlist Items" column of each corresponding URL and specify the numerical indexes separated by commas, e.g. "1,2,5,8" if you want to download the indexed media at 1, 2, 5, 8 of the playlist. It is also possible to specify intervals, e.g. "1-3,7,10-13" with which the media at index 1, 2, 3, 7, 10, 11, 12 and 13 will be downloaded.
ru_ru: Чтобы проиндексировать медиафайлы плейлиста, щелкните столбец «Элементы плейлиста» каждого соответствующего URL-адреса и укажите числовые индексы, разделенные запятыми, например: «1,2,5,8», если вы хотите загрузить проиндексированные медиафайлы на позициях 1, 2, 5, 8 в плейлисте. Также можно указать интервалы, например. «1-3,7,10-13», с помощью которого будут загружаться медиафайлы с индексами 1, 2, 3, 7, 10, 11, 12 и 13.

source: Playlist Editor
ru_ru: Редактор плейлистов(playlist)

source: Help viewer
ru_ru: Программа просмотра справки

source: ERROR: Invalid option
ru_ru: ОШИБКА: недопустимая опция

source: please try again.
ru_ru: пожалуйста, попробуйте снова.

source: OK: Indexes to download
ru_ru: ОК: индексы для загрузки

source: WARNING: The selected URL does not refer to a playlist. Only lines marked green can be indexed.
ru_ru: ВНИМАНИЕ! Выбранный URL-адрес не относится к списку воспроизведения. Индексировать можно только строки, отмеченные зелёным.

source: Invalid URL
ru_ru: Недопустимый URL

source: Invalid URLs
ru_ru: Недопустимые URL-адреса

source: Drag or paste URLs here
ru_ru: Перетащите или вставьте URL-адреса сюда

source: Set a new destination folder for downloads
ru_ru: Установите новую папку назначения для загрузок

source: Destination folder of downloads
ru_ru: Папка назначения для загрузок

source: Statistics viewer
ru_ru: Просмотр статистики

source: TITLE SELECTION
ru_ru: ВЫБОР НАЗВАНИЯ

source: Precompiled Videos
ru_ru: Предварительно скомпилированные видео

source: Download videos by resolution
ru_ru: Загрузка видео по разрешению

source: Download split audio and video
ru_ru: Скачать аудио и видео раздельно

source: Download Audio only
ru_ru: Загрузить только аудиофайл

source: Download by format code
ru_ru: Скачать код формата

source: Include playlists
ru_ru: Включить плейлисты

source: Subtitles Editor
ru_ru: Редактор субтитров

source: When not available, the chosen video resolution will be replaced with the closest one
ru_ru: Когда недоступно, выбранное разрешение видео будет заменено ближайшим
