Repository: Oakchris1955/Videomass
Catalog: videomass/data/locale/*/LC_MESSAGES/videomass.po
Languages: ru_ru

source: No default folder has been set for the destination of the encodings. The current setting is "Same destination paths as source files".
ru_ru: Для назначения кодировок не установлена ​​папка по умолчанию. Текущая настройка — «Те же пути назначения, что и исходные файлы».

source: '{}': No such file or directory
ru_ru: '{}': Данный файл или каталог отсутствует

source: Are you sure to empty trash folder?
ru_ru: Вы уверены, что очистили папку "Корзина"?

source: Installed release v{0}. No new updates found.
ru_ru: Установленная версия {0}. Новых обновлений не обнаружено.

source: Wait.... The archive is being downloaded
ru_ru: Подождите... Архив скачивается

source: Successfully downloaded to "{0}"
ru_ru: Успешно загружено в "{0}"

source: Some changes require restarting the application.
ru_ru: Некоторые изменения требуют перезапуска приложения.

source: {0} Do you want to restart the application now?
ru_ru: {0} Хотите перезапустить приложение сейчас?

source: Restart Videomass?
ru_ru: Перезапустить Видеомасс?

source: A new release is available - v.{0}
ru_ru: Доступна новая версия - v.{0}

source: You are using a development version that has not yet been released!
ru_ru: Вы используете версию для разработки, которая еще не выпущена!

source: Congratulation! You are already using the latest version.
ru_ru: Поздравляю! Вы уже используете последнюю версию.

source: Back
ru_ru: Назад

source: Next
ru_ru: Вперед

source: Home
ru_ru: Начальная панель

source: Play
ru_ru: Воспроизведение

source: Get informative data about imported media streams
ru_ru: Получайте информативные данные об импортированных медиапотоках

source: Start batch processing
ru_ru: Начать пакетную обработку

source: Stops current process
ru_ru: Останавливает текущий процесс

source: Add an item to Queue
ru_ru: Добавить элемент в очередь

source: Add to Queue
ru_ru: Добавить в очередь

source: Show queue
ru_ru: Показать очередь

source: Videomass - File List
ru_ru: Videomass - Список файлов

source: Videomass - AV Conversions
ru_ru: Videomass - AV-конвертация

source: Videomass - Presets Manager
ru_ru: Videomass - Менеджер Пресетов

source: Videomass - From Movie to Pictures
ru_ru: Videomass - Картинки из фильма

source: Have to select an item in the file list first
ru_ru: Сначала необходимо выбрать элемент в списке файлов

source: An item with the same destination file already exists. Do you want to replace it by adding the new item to the queue?
ru_ru: Элемент с таким же целевым файлом уже существует. Хотите заменить его, добавив новый элемент в очередь?

source: Videomass - FFmpeg Message Monitoring
ru_ru: Videomass - Мониторинг сообщений FFmpeg

source: yt-dlp is disabled. Check your preferences.
ru_ru: yt-dlp отключен. Проверьте свои настройки.

source: Media:
ru_ru: Медиа:

source: Container:
ru_ru: Контейнер:

source: Miscellaneous
ru_ru: Разное

source: Available video encoders. "Copy" means that the video stream will not be re-encoded and will allow you (depending on the encoder) to change the container, audio codec and a few other parameters.
ru_ru: Доступные видеокодеры. «Копировать» означает, что видеопоток не будет перекодироваться и позволит вам (в зависимости от кодировщика) изменить контейнер, аудиокодек и некоторые другие параметры.

source: Container format. It is usually represented by the file extension (output format). If the Media target is set to "Video" and the Video Encoder to "Copy", optionally you can set this control to "Copy" the same container as source file. If the media target is set to "Audio", you can extract only the audio streams from videos, or simply convert audio source files.
ru_ru: Формат контейнера. Обычно он представлен расширением файла (выходным форматом). Если для цели мультимедиа установлено значение «Видео», а для видеокодера — «Копировать», при желании вы можете установить для этого элемента управления значение «Копировать» тот же контейнер, что и исходный файл. Если для цели мультимедиа установлено значение «Аудио», вы можете извлекать из видео только аудиопотоки или просто конвертировать исходные аудиофайлы.

source: Set output files target: "Video" to save output files as video files; "Audio" to save files using an audio encoder and format. Note that by using "Audio" as the target, you will still be able to work on the video source files but you will only be able to extract the audio streams, convert them and apply audio filters such as normalization.
ru_ru: Установите цель выходных файлов: «Видео», чтобы сохранить выходные файлы как видеофайлы; «Аудио» для сохранения файлов с использованием аудиокодера и формата. Обратите внимание, что, используя «Аудио» в качестве цели, вы по-прежнему сможете работать с исходными видеофайлами, но сможете только извлекать аудиопотоки, конвертировать их и применять аудиофильтры, такие как нормализация.

source: Preview video filters
ru_ru: Предварительный просмотр с учётом фильтров FFplay

source: Resize
ru_ru: Изменить размер

source: Crop
ru_ru: Обрезать

source: Transpose
ru_ru: Поворот

source: Denoise
ru_ru: Шумоподавление

source: Equalize
ru_ru: Цветокоррекция

source: Unable to preview Video Stabilizer filter
ru_ru: Невозможно просмотреть Stabilizer видеофильтр

source: Unsupported file: Missing decoder or library? Check FFmpeg configuration.
ru_ru: Неподдерживаемый файл: Отсутствует декодер или библиотека? Проверьте конфигурацию FFmpeg.

source: The file is not a frame or a video file
ru_ru: Файл не является кадром или видеофайлом

source: Undetected volume values! Click the "Volume detect" button to analyze audio volume data.
ru_ru: Не обнаружены значения громкости! Нажмите кнопку «Обнаружение громкости», чтобы проанализировать данные о громкости звука.

source: Off
ru_ru: Выключено

source: Batch processing items Destination Automation/Preset Encoding passes Output Format Video Codec Audio Codec Audio Normalization Output multimedia type Start of segment Clip duration
ru_ru: Пакетная обработка элементов Место назначения Автоматизация/Пресет Encoding passes Выходной формат Видео кодек Аудиокодек Нормализация звука Тип полученного мультимедиа Начало сегмента Продолжительность клипа

source: Enter name for new preset
ru_ru: Введите имя для нового пресета

source: Audio encoder settings, mapping and filters
ru_ru: Настройки аудиокодера, сопоставление и фильтры

source: Audio Encoder
ru_ru: Аудио кодировщик

source: Settings
ru_ru: Настройки

source: Index Selection:
ru_ru: Выбор индекса:

source: Normalization
ru_ru: Нормализация

source: Volume detect
ru_ru: Обнаружение громкости

source: Volume Statistics
ru_ru: Статистика громкости

source: Target level:
ru_ru: Целевой уровень:

source: Gets maximum volume and average volume data in dBFS, then calculates the offset amount for audio normalization.
ru_ru: Получает данные о максимальной и средней громкости в dBFS, затем вычисляет величину смещения для нормализации звука.

source: Limiter for the maximum peak level or the mean level (when switch to RMS) in dBFS. From -99.0 to +0.0; default for PEAK level is -1.0; default for RMS is -20.0
ru_ru: Ограничитель максимального пикового уровня или среднего уровня (при переключении на RMS) в dBFS. От -99,0 до +0,0; по умолчанию для уровня PEAK -1,0; по умолчанию для RMS -20.0

source: Normally on a video with correctly indexed streams and having one or more audio streams, the first audio stream should be indexed at "1", the second at "2" and so on (the video stream on the other hand is always indexed at "0"). In this case it is recommended to select the desired stream by setting a specific index, e.g "1" for for the first available audio stream. Set this control to "Auto" if the source file is simply an audio track.
ru_ru: Обычно в видео с правильно проиндексированными потоками и наличии одного или нескольких аудиопотоков первый аудиопоток должен быть проиндексирован как «1», второй как «2» и т. д. (с другой стороны, видеопоток всегда индексируется как « 0"). В этом случае рекомендуется выбрать нужный поток, установив определенный индекс, например «1» для первого доступного аудиопотока. Установите для этого элемента управления значение «Авто», если исходный файл представляет собой просто звуковую дорожку.

source: "Auto" keeps all audio streams and processes only the one selected by the "Index Selection" control. "All" processes all audio streams in a video with the properties of the one selected by the "Index Selection" control. "Index Only" processes only the audio stream selected by the "Index Selection" control and removes all others from the video
ru_ru: «Авто» сохраняет все аудиопотоки и обрабатывает только тот, который выбран с помощью элемента управления «Выбор индекса». «All» обрабатывает все аудиопотоки в видео со свойствами того, который выбран с помощью элемента управления «Выбор индекса». «Индекс Only» обрабатывает только аудиопоток, выбранный с помощью элемента управления «Выбор индекса», и удаляет все остальные из видео

source: Integrated Loudness Target in LUFS. From -70.0 to -5.0, default is -16.0
ru_ru: Интегрированная цель громкости в LUFS. От -70,0 до -5,0, по умолчанию - -16,0

source: Maximum True Peak in dBTP. From -1.5 to +0.0, default is -2.0
ru_ru: Максимальный True Peak в dBTP. От -1,5 до +0,0, по умолчанию — -2,0

source: Loudness Range Target in LUFS. From +1.0 to +20.0, default is +11.0
ru_ru: Целевой диапазон громкости в LUFS. От +1,0 до +20,0, по умолчанию +11,0

source: Play the audio stream selected in the "Index Selection" control. Using this function you can test the result of audio normalization.
ru_ru: Воспроизведите аудиопоток, выбранный в элементе управления «Выбор индекса». Используя эту функцию, вы можете проверить результат нормализации звука.

source: Selected index does not exist or does not contain any audio streams
ru_ru: Выбранный индекс не существует или не содержит никаких аудиопотоков

source: ERROR: Missing audio stream: "{}"
ru_ru: ОШИБКА: Отсутствует аудиопоток: "{}"

source: No Audio
ru_ru: Нет звука

source: PEAK level normalization, which will produce a maximum peak level equal to the set target level.
ru_ru: Нормализация уровня PEAK, которая обеспечивает максимальный пиковый уровень, равный установленному целевому уровню.

source: RMS-based normalization, which according to mean volume calculates the amount of gain to reach same average power signal.
ru_ru: Нормализация на основе среднеквадратичного значения(RMS), которая в соответствии со средним объемом вычисляет величину усиления, необходимую для достижения сигнала той же средней мощности.

source: Loudnorm normalization. Normalizes the perceived loudness using the "loudnorm" filter, which implements the EBU R128 algorithm. Ideal for live normalization. It produces worse results than the High-quality two-pass Loudnorm normalization, but is faster.
ru_ru: Нормализация громкости. Нормализует воспринимаемую громкость с помощью фильтра «loudnorm», реализующего алгоритм EBU R128. Идеально подходит для живой нормализации. Он дает худшие результаты, чем высококачественная двухпроходная нормализация Loudnorm, но работает быстрее.

source: High-quality two-pass Loudnorm normalization. Normalizes the perceived loudness using the "loudnorm" filter, which implements the EBU R128 algorithm. Ideal for postprocessing.
ru_ru: Качественная двухпроходная нормализация Loudnorm. Нормализует воспринимаемую громкость с помощью фильтра «loudnorm», реализующего алгоритм EBU R128. Идеально подходит для постобработки.

source: Reload
ru_ru: Перезагрузить

source: Optimize for Web
ru_ru: Оптимизация для Web

source: Reloads the selected video encoder settings. Changes will be discarded.
ru_ru: Перезагружает выбранные настройки видеокодера. Изменения будут отменены.

source: Constant rate factor. Lower values correspond to higher quality and greater file size. Set to -1 to disable this control.
ru_ru: Коэффициент постоянной скорости. Более низкие значения соответствуют более высокому качеству и большему размеру файла. Установите значение -1, чтобы отключить этот элемент управления.

source: Number of tile rows to use, default changes per resolution
ru_ru: Количество используемых строк плитки, изменения по умолчанию для каждого разрешения

source: Number of tile columns to use, default changes per resolution
ru_ru: Количество используемых столбцов плиток, изменения по умолчанию для каждого разрешения

source: Set the Group Of Picture (GOP). Set to -1 to disable this control.
ru_ru: Установите группу изображений (GOP). Установите значение -1, чтобы отключить этот элемент управления.

source: It can reduce the file size, but takes longer.
ru_ru: Это может уменьшить размер файла, но занимает больше времени.

source: Set minimum bitrate tolerance. Most useful in setting up a CBR encode. It is of little use otherwise. Set to -1 to disable this control.
ru_ru: Установите минимальный допустимый битрейт. Наиболее полезен при настройке кодирования CBR. В противном случае от него мало пользы. Установите значение -1, чтобы отключить этот элемент управления.

source: Specifies a maximum tolerance. Requires bufsize to be set. Set to -1 to disable this control.
ru_ru: Определяет максимальный допуск. Требуется установить bufsize. Установите значение -1, чтобы отключить этот элемент управления.

source: Set ratecontrol buffer size, which determines the variability of the output bitrate. Set to -1 to disable this control.
ru_ru: Установите размер буфера управления скоростью, который определяет изменчивость выходного битрейта. Установите значение -1, чтобы отключить этот элемент управления.

source: Specifies the target (average) bit rate for the encoder to use. Higher value = higher quality. Set -1 to disable this control.
ru_ru: Указывает целевую (среднюю) скорость передачи данных, которую будет использовать кодер. Более высокая ценность = более высокое качество. Установите -1, чтобы отключить этот элемент управления.

source: Video width and video height ratio.
ru_ru: Соотношение ширины и высоты видео.

source: Frame rate (frames per second). Frames repeat a given number of times per second. In some countries this is 30 for NTSC, other countries (like Italy) use 25 for PAL
ru_ru: Частота кадров (кадров в секунду). Кадры повторяются заданное количество раз в секунду. В некоторых странах это 30 для NTSC, другие страны (например, Италия) используют 25 для PAL

source: Quality/Speed ratio modifier. CPU Used sets how efficient the compression will be. Lower values mean slower encoding with better quality, and vice-versa. Valid values are from 0 to 8 inclusive.
ru_ru: Модификатор соотношения качество/скорость. Параметр «Использование ЦП» определяет, насколько эффективным будет сжатие. Более низкие значения означают более медленное кодирование с лучшим качеством и наоборот. Допустимые значения от 0 до 8 включительно.

source: Quality and compression efficiency vs speed trade-off. "good" is the default and recommended for most applications; "realtime" is recommended for live/fast encoding (live streaming, video conferencing, etc); "allintra" for All Intra encoding.
ru_ru: Качество и эффективность сжатия в сравнении со скоростью. «good» — значение по умолчанию и рекомендуется для большинства приложений; «realtime» рекомендуется для живого/быстрого кодирования (потоковое вещание, видеоконференции и т. д.); «allintra» для кодирования All Intra.

source: Row Multi-Threading enables row-based multi-threading which maximizes CPU usage. To enable fast decoding performance, also set tiles (i.e. Tile Columns 4 and Tile Rows 1 or Tile Columns 2 and Tile Rows 2 for 4 tiles). Enabling Row Multi-Threading is only faster when the CPU has more threads than the number of encoded tiles.
ru_ru: Многопоточность строк обеспечивает многопоточность на основе строк, что максимально увеличивает загрузку ЦП. Чтобы обеспечить высокую производительность декодирования, также установите плитки (например, «Столбцы плиток 4» и «Ряды плиток 1» или «Столбцы плиток 2» и «Ряды плиток 2» для 4 плиток). Включение многопоточности строк происходит быстрее только в том случае, если количество потоков процессора превышает количество закодированных плиток.

source: presets 1-3 represent extremely high efficiency, for use when encode time is not important and quality/size of the resulting video file is critical. Presets 4-6 are commonly used by home enthusiasts as they represent a balance of efficiency and reasonable compute time. Presets between 7 and 12 are used for fast and real-time encoding. Preset 13 is even faster but not intended for direct human consumption--it can be used, for example, as a per-scene quality metric in VOD applications. One should use the lowest preset that is tolerable.
ru_ru: пресеты 1–3 обеспечивают чрезвычайно высокую эффективность и подходят для использования, когда время кодирования не имеет значения, а качество/размер результирующего видеофайла имеет решающее значение. Пресеты 4–6 обычно используются домашними энтузиастами, поскольку они представляют собой баланс эффективности и разумного времени вычислений. Пресеты от 7 до 12 используются для быстрого кодирования в реальном времени. Пресет 13 еще быстрее, но не предназначена для непосредственного использования человеком — ее можно использовать, например, в качестве показателя качества каждой сцены в приложениях VOD. Следует использовать наименьшую допустимую настройку.

source: Constant rate factor. This parameter governs the quality/size trade-off. Higher CRF values will result in a final output that takes less space, but begins to lose detail. Lower CRF values retain more detail at the cost of larger file sizes. A good starting point for 1080p video is 30. Set to -1 to disable this control.
ru_ru: Constant rate factor. This parameter governs the quality/size trade-off. Higher CRF values will result in a final output that takes less space, but begins to lose detail. Более низкие значения CRF сохраняют больше деталей за счет увеличения размера файла. Хорошей отправной точкой для видео 1080p является 30. Установите значение -1, чтобы отключить этот элемент управления.

source: The "Film Grain" parameter allows SVT-AV1 to detect and delete film grain from the source video, and replace it with synthetic grain of the same character, resulting in significant bitrate savings. A value of 8 is a reasonable starting point for live-action video with a normal amount of grain. Higher values in the range of 10-15 enable more aggressive use of this technique for video with lots of natural grain. For 2D animation, lower values in the range of 4-6 are often appropriate. If the source video does not have natural grain, this parameter can be set to -1 to disable it or at least 0.
ru_ru: Параметр «Зернистость пленки» позволяет SVT-AV1 обнаруживать и удалять зернистость пленки из исходного видео и заменять ее синтетической зернистостью того же символа, что приводит к значительной экономии битрейта. Значение 8 — разумная отправная точка для живого видео с нормальным количеством зернистости. Более высокие значения в диапазоне 10–15 позволяют более агрессивно использовать эту технику для видео с большим количеством естественного зерна. Для 2D-анимации часто подходят более низкие значения в диапазоне 4–6. Если исходное видео не имеет естественного зерна, для этого параметра можно установить значение -1, чтобы отключить его или, по крайней мере, 0.

source: If enabled, the "Film Grain Denoiser" option can mitigate the detail removal caused by high "Film Grain" values required to preserve the look of very grainy films By default, the denoised frames are passed to be encoded as the final pictures, enabling this feature will lead to the original frames to be used instead.
ru_ru: Если опция «Подавитель зернистости пленки» включена, она может смягчить удаление деталей, вызванное высокими значениями «Зернистости пленки», необходимыми для сохранения вида очень зернистых пленок. По умолчанию кадры с шумоподавлением передаются для кодирования в качестве окончательных изображений. Включение этой функции приведет к использованию вместо них исходных кадров.

source: Enables encoder optimization to produce faster (less CPU intensive) bit streams to decode, similar to the fastdecode tuning in x264 and x265.
ru_ru: Включает оптимизацию кодировщика для создания более быстрых (менее ресурсоемких) битовых потоков для декодирования, аналогично настройке fastdecode в x264 и x265.

source: Set profile restrictions
ru_ru: Установить ограничения профиля

source: Specify level for a selected profile
ru_ru: Укажите уровень для выбранного профиля

source: Tune the encoding params
ru_ru: Настройте параметры кодирования

source: Set the encoding preset (default "medium")
ru_ru: Установите пресет кодирования (по умолчанию "medium")

source: specifies the target (average) bit rate for the encoder to use. Higher value = higher quality. Set -1 to disable this control.
ru_ru: определяет целевую (в среднем) скорость передачи данных для кодировщика. Высокая значение = высокое качество. Установите значение -1, чтобы отключить эту проверку.

source: Variable Bit Rate. From 0-30, with 1 being highest quality/largest filesize and 30 being the lowest quality/smallest filesize. Set to -1 to disable this control.
ru_ru: Переменный битрейт. От 0 до 30, где 1 — самое высокое качество/самый большой размер файла, а 30 — самое низкое качество/наименьший размер файла. Установите значение -1, чтобы отключить этот элемент управления.

source: Frames repeat a given number of times per second. In some countries this is 30 for NTSC, other countries (like Italy) use 25 for PAL
ru_ru: Кадры повторяются заданное количество раз в секунду. В некоторых странах это 30 для NTSC, другие страны (например, Италия) используют 25 для PAL

source: The default FourCC stored in an MPEG-4-coded file will be FMP4. If you want a different FourCC, set this option to xvid to force the FourCC xvid to be stored as the video FourCC rather than the default.
ru_ru: По умолчанию FourCC, хранящийся в файле с кодировкой MPEG-4, будет FMP4. Если вам нужен другой FourCC, установите для этого параметра значение xvid, чтобы xvid FourCC сохранялся как видео FourCC, а не как видео по умолчанию.

source: ...The Media target you just selected will only allow you to save files as audio tracks. You can then process audio source files or extract audio streams indexed to video files.
ru_ru: ...Только что выбранный вами объект Media позволит вам сохранять файлы только в виде звуковых дорожек. Затем вы можете обрабатывать исходные аудиофайлы или извлекать аудиопотоки, индексированные в видеофайлы.

source: Speed sets how efficient the compression will be. When the Quality parameter is "good" or "best", values for Speed can be set between 0 and 5. Using 1 or 2 will increase encoding speed at the expense of having some impact on quality and rate control accuracy. 4 or 5 will turn off rate distortion optimization, having even more of an impact on quality. When the Quality is set to realtime, the available values for Speed are 0 to 8.
ru_ru: Скорость определяет, насколько эффективным будет сжатие. Если параметр «Качество» имеет значение «хорошее» или «лучшее», значения скорости можно установить от 0 до 5. Использование 1 или 2 увеличит скорость кодирования за счет некоторого влияния на качество и точность управления скоростью. 4 или 5 отключат оптимизацию искажений скорости, что еще больше повлияет на качество. Если для параметра «Качество» установлено значение «В реальном времени», доступные значения для «Скорость» составляют от 0 до 8.
