Repository: Oakchris1955/Videomass
Catalog: videomass/data/locale/*/LC_MESSAGES/videomass.po
Languages: ru_ru

source: Show text box
ru_ru: Показать текстовое поле

source: Box Color
ru_ru: Цвет поля

source: The timestamp size does not auto-adjust to the video size, you have to set the size here
ru_ru: Размер шкалы времени воспроизведения не подстраивается автоматически под размер видео, вы должны установить размер здесь

source: Timestamp settings
ru_ru: Настройки шкалы времени воспроизведения

source: Where do you prefer to save your transcodes?
ru_ru: Где вы предпочитаете сохранять перекодировки?

source: Change
ru_ru: Изменить

source: Same destination paths as source files
ru_ru: Те же пути назначения, что и у исходных файлов

source: Assign optional suffix to destination file names:
ru_ru: Присвойте необязательный суффикс именам файлов назначения:

source: File removal preferences
ru_ru: Настройки удаления файлов

source: Trash the source files after successful encoding
ru_ru: Удалить исходные файлы после успешного кодирования

source: File Preferences
ru_ru: Файл

source: Location of executables
ru_ru: Расположение исполняемых файлов

source: Enable a custom location to run FFmpeg
ru_ru: Включите собственное местоположение для запуска FFmpeg

source: Enable a custom location to run FFprobe
ru_ru: Включите пользовательское местоположение для запуска FFprobe

source: Enable a custom location to run FFplay
ru_ru: Включите пользовательское местоположение для запуска FFplay

source: Download videos from YouTube.com and other video sites (requires application restart)
ru_ru: Скачивайте видео с YouTube.com и других видеосайтов (требуется перезапуск приложения)

source: Enable yt-dlp
ru_ru: Включить yt-dlp

source: Icon themes
ru_ru: Темы значков

source: At the top of window (default)
ru_ru: Вверху (по умолчанию)

source: At the bottom of window
ru_ru: Внизу

source: At the right of window
ru_ru: Справа

source: At the left of window
ru_ru: Слева

source: Place the toolbar
ru_ru: Разместите панель инструментов

source: Toolbar's icons size:
ru_ru: Размер значков панели инструментов:

source: Configuration directory
ru_ru: Каталог конфигурации

source: Cache directory
ru_ru: Каталог кэша

source: Log directory
ru_ru: Папка log-журнала

source: The following settings affect output messages and the log messages during transcoding processes. Be careful, by changing these settings some functions of the application may not work correctly, change only if you know what you are doing.
ru_ru: Следующие настройки влияют на выходные сообщения и сообщения журнала во время процессов перекодирования. Будьте внимательны, при изменении этих настроек некоторые функции приложения могут работать некорректно, изменяйте, только если вы знаете, что делаете.

source: FFmpeg logging levels
ru_ru: Комплект log-журналов FFmpeg

source: By assigning an additional suffix you could avoid overwriting files
ru_ru: Назначив дополнительный суффикс, вы можете избежать перезаписи файлов

source: Choose Destination
ru_ru: Выберите папку назначения

source: Enter only alphanumeric characters. You can also use the hyphen ("-") and the underscore ("_"). Spaces are not allowed.
ru_ru: Вводите только буквенно-цифровые символы. Вы также можете использовать дефис ("-") и подчеркивание ("_"). Пробелы не допускаются.

source: Get Latest Version
ru_ru: Получить последнюю версию

source: Checking for newer version
ru_ru: Проверить последнюю версию

source: New releases fix bugs and offer new features.
ru_ru: Новые выпуски исправляют ошибки и предлагают новые функции.

source: This is Videomass v.{0}
ru_ru: Это Videomass v.{0}

source: Format
ru_ru: Формат

source: Video Stream
ru_ru: Видео поток

source: Audio Streams
ru_ru: Аудио потоки

source: Subtitle Streams
ru_ru: Потоки субтитров

source: Copy to clipboard
ru_ru: Скопировать в буфер обмена

source: FILE SELECTION
ru_ru: ВЫБОР ФАЙЛА

source: Properties
ru_ru: Характеристики

source: Values
ru_ru: Значения

source: Streams Properties
ru_ru: Свойства потоков

source: Unable to open the clipboard on Format tab
ru_ru: Не удается открыть буфер обмена на вкладке «Формат»

source: Unable to open the clipboard on Video Streams tab
ru_ru: Невозможно открыть буфер обмена на вкладке «Видеопотоки»

source: Unable to open the clipboard on Audio Streams tab
ru_ru: Невозможно открыть буфер обмена на вкладке «Аудиопотоки»

source: Unable to open the clipboard on Subtitle Streams tab
ru_ru: Невозможно открыть буфер обмена на вкладке «Потоки субтитров»

source: Log file list
ru_ru: Список log-файлов

source: Log messages
ru_ru: Log-журнал

source: Refresh log messages
ru_ru: Обновить log-журналы

source: Clear log messages
ru_ru: Очистить log-журналы

source: Select a log file
ru_ru: Выберите файл журнала

source: Are you sure you want to clear the selected log file?
ru_ru: Вы действительно хотите удалить выбранный файл log-журнала?

source: Contextual help based on the argument entered in the additional text field. Each argument consists of the type and a type-specific name. For the list of encoders click the "Encoders" button. For the list of decoders click on the "Decoders" button. For the muxers and demuxers click on the "Muxers and Demuxers" button. For the filters, select "Show available filters" in the drop down menu. For the bsf, select "Show available bitstream filters" in the drop down menu. For the protocols, select "Show available protocols" in the drop down menu. Some examples:
ru_ru: Контекстная справка на основе аргумента, введенного в дополнительное текстовое поле. Каждый аргумент состоит из типа и имени, специфичного для типа. Чтобы просмотреть список кодировщиков, нажмите кнопку «Кодировщики». Чтобы просмотреть список декодеров, нажмите кнопку «Декодеры». Для мультиплексоров и демультиплексоров нажмите кнопку «Мультиплексоры и демультиплексоры». Для фильтров выберите «Показать доступные фильтры» в раскрывающемся меню. Для bsf выберите «Показать доступные фильтры битового потока» в раскрывающемся меню. Для протоколов выберите «Показать доступные протоколы» в раскрывающемся меню. Некоторые примеры:

source: Help topic
ru_ru: Раздел справки

source: List basic options
ru_ru: Список основных опций

source: List more options
ru_ru: Список дополнительных опций

source: List all options (very long)
ru_ru: Список всех вариантов (очень длинный)

source: Show available devices
ru_ru: Показать доступные устройства

source: Show available bit stream filters
ru_ru: Показать доступные фильтры битового потока

source: Show available protocols
ru_ru: Показать доступные протоколы

source: Show available filters
ru_ru: Показать доступные фильтры

source: Show available pixel formats
ru_ru: Показать доступные форматы пикселей

source: Show available audio sample formats
ru_ru: Показать доступные форматы аудио образцов

source: Show available color names
ru_ru: Показать доступные названия цветов

source: List sources of the input device
ru_ru: Список источников устройства ввода

source: List sinks of the output device
ru_ru: Список sinks выходного устройства

source: Show available HW acceleration methods
ru_ru: Показать доступные методы аппаратного ускорения

source: Show license
ru_ru: Показать лицензию

source: Show configuration
ru_ru: Показать конфигурацию

source: Encoders
ru_ru: Кодеры

source: Decoders
ru_ru: Декодеры

source: Muxers and Demuxers
ru_ru: Мультиплексоры и Демультиплексоры

source: help topic list
ru_ru: список тем справки

source: Type the argument here and confirm with the enter key on your keyboard
ru_ru: Введите здесь аргумент и подтвердите нажатием клавиши ввода на клавиатуре

source: The search function allows you to find entries in the current topic
ru_ru: Функция поиска позволяет находить записи в текущей теме

source: Ignore case
ru_ru: Игнорировать регистр

source: Ignore case distinctions: characters with different case will match.
ru_ru: Не обращайте внимания на различие в регистре: символы с другим регистром будут совпадать.

source: FFmpeg help topics
ru_ru: Разделы справки FFmpeg

source: This is a multifunctional search tool useful for local help searches on multiple FFmpeg topics and options. The search control, to find occurences on text obtained from the chosen argument, is very similar to what grep does on the Unix shell, but here it's done in real time. If you don't find support for a certain codec or other feature, it's likely that your version of FFmpeg is too old or not configured with those features.
ru_ru: Это многофункциональный инструмент поиска, полезный для локального поиска справки по нескольким темам и параметрам FFmpeg. Управление поиском, чтобы найти вхождения в текст, полученный из выбранного аргумента, очень похоже на то, что делает grep в оболочке Unix, но здесь это делается в реальном времени. Если вы не найдете поддержку определенного кодека или другой функции, вероятно, ваша версия FFmpeg устарела или не поддерживает эти функции.

source: ..Nothing available
ru_ru: ..Данные недоступны

source: ..Not found
ru_ru: ..Не найдено

source: Before
ru_ru: До

source: After
ru_ru: После

source: Color EQ
ru_ru: Цвет EQ

source: Contrast:
ru_ru: Контраст:

source: -100 to +100, default value 0
ru_ru: от -100 до +100, значение по умолчанию 0

source: Brightness:
ru_ru: Яркость:

source: Saturation:
ru_ru: Насыщенность:

source: 0 to 300, default value 100
ru_ru: от 0 до 300, значение по умолчанию 100

source: Gamma:
ru_ru: Гамма:

source: 0 to 100, default value 10
ru_ru: от 0 до 100, значение по умолчанию 10

source: Color Correction EQ Tool
ru_ru: Эквалайзер для цветокоррекции

source: Informations
ru_ru: Информация

source: Flags settings
ru_ru: Настройки флагов

source: Flags enabled
ru_ru: Флаги включены

source: Flags disabled
ru_ru: Флаги отключены

source: FFmpeg configuration
ru_ru: Конфигурация FFmpeg

source: flags
ru_ru: флаги

source: options
ru_ru: параметры

source: status
ru_ru: статус

source: FFprobe ...not found !
ru_ru: FFprobe ...не найдено !

source: FFplay ...not found !
ru_ru: FFplay ...не найдено !

source: Enabled
ru_ru: Включено

source: Disabled
ru_ru: Отключено

source: FFmpeg encoders
ru_ru: Кодировщики FFmpeg

source: supported encoders
ru_ru: поддерживаемые кодеры

source: FFmpeg decoders
ru_ru: Декодеры FFmpeg

source: supported decoders
ru_ru: поддерживаемые декодеры

source: Video
ru_ru: Видео

source: Audio
ru_ru: Аудио

source: Subtitle
ru_ru: Субтитры

source: description
ru_ru: описание

source: Demuxing only
ru_ru: Только демультиплексирование

source: Muxing only
ru_ru: Только мультиплексирование

source: Demuxing/Muxing support
ru_ru: Поддержка демультиплексирования/мультиплексирования

source: FFmpeg file formats
ru_ru: Форматы файлов FFmpeg

source: supported formats
ru_ru: поддерживаемые форматы

source: File name
ru_ru: Имя файла

source: Max volume dBFS
ru_ru: Максимальная громкость dBFS

source: Mean volume dBFS
ru_ru: Средняя громкость dBFS

source: Offset dBFS
ru_ru: Смещение dBFS

source: Result dBFS
ru_ru: Результат DBFS

source: Post-normalization references:
ru_ru: Ссылки после нормализации:

source: = No changes
ru_ru: = Без изменений

source: = Below max peak
ru_ru: = Ниже максимального пика

source: RMS-based volume statistics
ru_ru: Статистика звука на основе RMS

source: PEAK-based volume statistics
ru_ru: Статистика звука на основе PEAK

source: ...It means the resulting audio will be clipped, because its volume is higher than the maximum 0 db level. This results in data loss and the audio may sound distorted.
ru_ru: ...Это означает, что результирующий звук будет обрезан, потому что его громкость превышает максимальный уровень 0 дБ. Это приводит к потере данных и искажению звука.

source: ...It means the resulting audio will not change, because it's equal to the source.
ru_ru: ...Это означает, что результирующий звук не изменится, потому что он равен источнику.

source: ...It means an audio signal will be produced with a lower volume than the source.
ru_ru: ...Это означает, что аудиосигнал будет воспроизводиться с меньшей громкостью, чем исходный.

source: q, ESC f p, SPC m 9, 0 /, * a v t c w s left/right down/up page down/page up right mouse click left mouse double-click
ru_ru: q, ESC f p, SPC m 9, 0 /, * a v t c w s влево/вправо вниз/вверх страница вниз/страница вверх щелчок правой кнопкой мыши двойной щелчок левой кнопкой мыши

source: Shortcut keys while playing with FFplay
ru_ru: Сочетания клавиш во время проигрывания с FFplay

source: Edit
ru_ru: Редактировать

source: Remove
ru_ru: Удалить

source: Remove all
ru_ru: Удалить все

source: Export queue file
ru_ru: Экспорт файла очереди(.json)

source: Import queue file
ru_ru: Импортировать файл очереди

source: Destination file name
ru_ru: Имя файла назначения

source: Remove all items in the queue
ru_ru: Удалить все элементы в очереди

source: Videomass - Queue
ru_ru: Videomass - Очередь

source: Export queue file
ru_ru: Экспортировать файл очереди(.json)

source: Same as source
ru_ru: Так же, как источник

source: Source File destination Automation/Preset Encoding passes Output Format Start of segment Clip duration
ru_ru: Источник Место назначения файла Автоматизация/Пресет Encoding passes Выходной формат Начало сегмента Продолжительность клипа

source: Videomass - Edit the selected item in the queue
ru_ru: Videomass - Редактировать выбранный элемент в очереди

source: Start point adjustment
ru_ru: Регулировка точки "Начало"

source: End point adjustment
ru_ru: Регулировка точки "Конец"

source: Hours
ru_ru: Часы

source: Minutes
ru_ru: Минуты

source: Seconds
ru_ru: Секунды

source: Milliseconds
ru_ru: Миллисекунды

source: No source duration:
ru_ru: Нет длительности источника:

source: {0} {1} | Segment Duration: {2}
ru_ru: {0} {1} | Продолжительность сегмента: {2}

source: End adjustment
ru_ru: Регулировка "Конец"

source: Start adjustment
ru_ru: Регулировка "Начало"

source: Source duration:
ru_ru: Длительность источника:

source: WARNING: Invalid selection, out of range.
ru_ru: WARNING: Неверный выбор, вне допустимого диапазона.

source: Start by dragging the bottom left handle, or right-click for options.
ru_ru: Начните с перетаскивания нижнего левого маркера или щелкните правой кнопкой мыши для выбора параметров.

source: Start
ru_ru: Начало

source: End
ru_ru: Конец

source: The timeline editor is a tool that allows you to trim slices of time on selected imported media (see File List panel). The "time format" used to report durations is expressed in hours, minutes, seconds and milliseconds (HH:MM:SS.ms). Note that importing new files, making new selection, deselection, deleting items, sorting items (ie by LEFT clicking on the column headers), will reset any previous settings to default values. If the File List panel is empty or no source files are selected, the overall duration values will be set to 23:59:59.999, rather than the duration of a selected source file (see status bar messages). The "Start"/"End" duration values always refer to the initial position of the timeline: 00:00:00.000. For other informations as the segment duration and warnings, please refer to the status bar messages.
ru_ru: Редактор timeline — это инструмент, который позволяет обрезать фрагменты времени на выбранных импортированных медиафайлах (см. панель «Список файлов»). «Формат времени», используемый для сообщения о продолжительности, выражается в часах, минутах, секундах и миллисекундах (ЧЧ:ММ:СС.мс). Обратите внимание, что импорт новых файлов, новый выбор, отмена выбора, удаление элементов, сортировка элементов (т. е. нажатием левой кнопки мыши на заголовках столбцов) приведет к сбросу всех предыдущих настроек к значениям по умолчанию. Если панель «Список файлов» пуста или исходные файлы не выбраны, общие значения продолжительности будут установлены на 23:59:59,999, а не на продолжительность выбранного исходного файла (см. сообщения в строке состояния). Значения длительности «Начало» и «Конец» всегда относятся к начальному положению timeline: 00:00:00.000. Дополнительную информацию, такую ​​как продолжительность сегмента и предупреждения, можно найти в сообщениях строки состояния.

source: Timeline Editor Usage
ru_ru: Использование редактора Timeline

source: Files already exist, do you want to overwrite them?
ru_ru: Файлы уже существуют, перезаписать их?

source: Already exist
ru_ru: Уже существует

source: Not found
ru_ru: Не найдено

source: Error list
ru_ru: Список ошибок

source: File(s) not found
ru_ru: Файл(ы) не найден

source: Output folder does not exist: "{}"
ru_ru: Выходная папка не существует: "{}"

source: Wait.... Retrieving required data.
ru_ru: Пожалуйста, подождите... Получение необходимых данных.

source: File does not exist or is invalid: %s
ru_ru: Файл не существует или недействителен: %s

source: Wait.... Audio peak analysis.
ru_ru: Пожалуйста, подождите.... Анализ звуковых пиков.

source: Videomass - Downloading...
ru_ru: Videomass - Скачивание...

source: Supports ({0}) formats only, not ({1})
ru_ru: Поддерживаются только форматы ({0}), но не ({1})

source: File formats not supported by the selected profile
ru_ru: Форматы файлов, не поддерживаемые выбранным профилем

source: Warning
ru_ru: Предупреждение

source: No presets found. Possible solution: open the Presets Manager panel, go to the presets column and try to click the "Restore all..." button
ru_ru: Пресеты не найдены. Возможное решение: откройте панель Менеджер Пресетов, перейдите в столбец пресеты и попробуйте нажать кнопку «Восстановить всё ...»

source: Ready
ru_ru: Готово

source: Not all items in the queue were completed. Would you like to keep them in the queue?
ru_ru: Не все элементы в очереди были завершены. Хотите оставить их в очереди?

source: Queue ({0})
ru_ru: Очередь ({0})

source: Queue
ru_ru: Очередь

source: Are you sure you want to exit the application?
ru_ru: Вы уверены, что хотите выйти из приложения?

source: Exit
ru_ru: Выход

source: Import files Ctrl+O
ru_ru: Импортировать файлы Ctrl+O

source: Open destination folder of encodings Ctrl+D
ru_ru: Открыть папку назначения кодировок Ctrl+D

source: Load queue file
ru_ru: Загрузить файл очереди(.json)

source: Load a previously exported queue file
ru_ru: Загрузите ранее экспортированный файл очереди(.json)

source: Open trash
ru_ru: Открыть корзину

source: Open the Videomass trash folder
ru_ru: Откройте корзину Videomass

source: Empty trash
ru_ru: Очистить корзину

source: Delete all files in the Videomass trash folder
ru_ru: Удалить все файлы в корзине Videomass

source: Exit Ctrl+Q
ru_ru: Выход Ctrl+Q

source: Completely exit the application
ru_ru: Полностью выйти из приложения

source: File
ru_ru: Файл

source: Rename selected file Ctrl+R
ru_ru: Переименовать выбранный файл Ctrl+R

source: Rename the destination of the selected file
ru_ru: Переименуйте место назначения выбранного файла

source: Batch rename files Ctrl+B
ru_ru: Пакетное переименование файлов Ctrl+B

source: Numerically renames the destination of all items in the list
ru_ru: Численно переименовывает пункт назначения всех элементов в списке.

source: Remove selected entry DEL
ru_ru: Удалить выбранный файл DEL

source: Remove the selected file from the list
ru_ru: Удалить выбранный файл из списка

source: Clear list Shift+DEL
ru_ru: Очистить список Shift+DEL

source: Clear the file list
ru_ru: Очистить список файлов

source: Preferences Ctrl+P
ru_ru: Основные настройки Ctrl+P

source: Application preferences
ru_ru: Настройки приложения

source: Find FFmpeg topics
ru_ru: Найти темы FFmpeg

source: A useful tool to search for FFmpeg help topics and options
ru_ru: Полезный инструмент для поиска тем и параметров справки FFmpeg

source: Check for preset updates
ru_ru: Проверьте наличие обновления пресетов

source: Check for new presets updates from {0}
ru_ru: Проверьте наличие новых обновлений пресетов на {0}

source: Get latest presets
ru_ru: Получить последние пресеты

source: Get the latest presets from {0}
ru_ru: Получить последние пресеты по адресу {0}

source: Work notes Ctrl+N
ru_ru: Рабочие заметки Ctrl+N

source: Read and write useful notes and reminders.
ru_ru: Читайте и пишите полезные заметки и напоминания.

source: Tools
ru_ru: Инструменты

source: Show FFmpeg's built-in configuration capabilities
ru_ru: Показать встроенные возможности настройки FFmpeg

source: Muxers and demuxers available on your version of FFmpeg
ru_ru: Мультиплексоры и демультиплексоры доступны в вашей версии FFmpeg

source: Encoders available on your version of FFmpeg
ru_ru: Кодировщики, доступные в вашей версии FFmpeg

source: Decoders available on your version of FFmpeg
ru_ru: Декодеры, доступные в вашей версии FFmpeg

source: Enable timestamps on playback
ru_ru: Включить шкалу времени при воспроизведении

source: Displays timestamp when playing media with FFplay
ru_ru: Отображает шкалу времени при воспроизведении мультимедиа с помощью FFplay

source: Auto-exit after playback
ru_ru: Автоматический выход после воспроизведения

source: If checked, the FFplay window will auto-close when playback is complete
ru_ru: Если флажок установлен, окно FFplay будет автоматически закрываться после завершения воспроизведения

source: Customize the timestamp style
ru_ru: Настройте стиль метки времени

source: While playing...
ru_ru: Навигация во время проигрывания...

source: Show useful shortcut keys when playing or previewing using FFplay
ru_ru: Покажите полезные сочетания клавиш при воспроизведении или предварительном просмотре с помощью FFplay

source: Show timeline editor Ctrl+T
ru_ru: Показать редактор timeline Ctrl+T

source: Set duration or trim slices of time to remove unwanted parts from your files
ru_ru: Установите продолжительность или обрежьте отрезки времени, чтобы удалить ненужные части из ваших файлов

source: View
ru_ru: Посмотр

source: Home panel Ctrl+Shift+H
ru_ru: Начальная панель Ctrl+Shift+H

source: Go to the 'Home' panel
ru_ru: Перейдите к 'Начальной панели'

source: Presets Manager Ctrl+Shift+P
ru_ru: Менеджер Пресетов Ctrl+Shift+P

source: Go to the 'Presets Manager' panel
ru_ru: Перейдите на панель 'Менеджер пресетов'

source: A/V Conversions Ctrl+Shift+V
ru_ru: A/V Конвертация Ctrl+Shift+V

source: Go to the 'A/V Conversions' panel
ru_ru: Перейдите на панель 'A/V Конвертация'

source: Go to the 'Concatenate Demuxer' panel
ru_ru: Перейдите на панель 'Concatenate Demuxer'

source: Go to the 'Still Image Maker' panel
ru_ru: Перейдите на панель 'Still Image Maker'

source: From Movie to Pictures Ctrl+Shift+S
ru_ru: Картинки из фильма Ctrl+Shift+S

source: Go to the 'From Movie to Pictures' panel
ru_ru: Перейдите на панель 'Картинки из фильма'

source: YouTube Downloader Ctrl+Shift+Y
ru_ru: Загрузчик YouTube Ctrl+Shift+Y

source: Open 'YouTube Downloader' window
ru_ru: Откройте окно «Загрузчик с YouTube»

source: Output monitor Ctrl+Shift+O
ru_ru: Выходной монитор Ctrl+Shift+O

source: Keeps track of the output for debugging errors
ru_ru: Отслеживает вывод для отладки ошибок

source: Go
ru_ru: Переход

source: User guide
ru_ru: Руководство пользователя

source: Issue tracker
ru_ru: Сообщить о проблеме

source: Check for newer version
ru_ru: Проверить последнюю версию

source: Check for the latest Videomass version
ru_ru: Проверьте наличие последней версии Videomass

source: System version
ru_ru: Версия системы

source: Get version about your operating system, version of Python and wxPython.
ru_ru: Получить версию вашей операционной системы, версию Python и wxPython.

source: Show log files Ctrl+L
ru_ru: Показать файлы log-журналов Ctrl+L

source: Viewing log messages
ru_ru: Просмотр сообщений log-журнала

source: About Videomass
ru_ru: Информация об Videomass

source: Help
ru_ru: Помощь

source: Import files
ru_ru: Импортировать файлы
