Repository: Oakchris1955/Videomass
Catalog: videomass/data/locale/*/LC_MESSAGES/videomass.po
Languages: ru_ru

source: URLs have no playlist references
ru_ru: URL-адреса не имеют ссылок на плейлисты

source: The URLs contain playlists. Are you sure you want to continue?
ru_ru: URL-адреса содержат списки воспроизведения. Вы уверены, что хотите продолжить?

source: The URLs contain channels. Are you sure you want to continue?
ru_ru: URL-адреса содержат видеоканалы. Вы уверены, что хотите продолжить?

source: Workarounds
ru_ru: Обходные пути

source: Don’t check SSL certificate
ru_ru: Не проверять SSL-сертификат

source: Filename options
ru_ru: Параметры имени файла

source: Include the ID in file names
ru_ru: Включите идентификатор в имена файлов

source: Restrict file names to ASCII characters
ru_ru: Ограничить имена файлов символами ASCII

source: Post-Process options
ru_ru: Опции постобработки

source: Embed thumbnail in audio file
ru_ru: Добавить миниатюру в аудиофайл

source: Add metadata to file
ru_ru: Добавьте метаданные в файл

source: Overwrite all files and metadata
ru_ru: Перезаписать все файлы и метаданные

source: Where do you prefer to save your downloads?
ru_ru: Где вы предпочитаете сохранять загрузки?

source: Auto-create subdirectories when downloading playlists
ru_ru: Автоматически создавать подкаталоги при загрузке плейлистов

source: Choosing an external downloader
ru_ru: Выбор внешнего загрузчика

source: External downloader executable path
ru_ru: Исполняемый путь внешнего загрузчика

source: External downloader arguments
ru_ru: Аргументы внешнего загрузчика

source: Username
ru_ru: Имя пользователя

source: Password
ru_ru: Пароль

source: Authentication
ru_ru: Аутентификация

source: Russian
ru_ru: Русский

source: Subtitles
ru_ru: Субтитры

source: None
ru_ru: Без субтитров

source: All available subtitles
ru_ru: Все доступные субтитры

source: Select by default language
ru_ru: Выбрать язык по умолчанию

source: Custom language subtitles
ru_ru: Субтитры на языке пользователя

source: Custom language
ru_ru: Пользовательский язык

source: Subtitle options
ru_ru: Параметры субтитров

source: Include automatically generated subtitle (YouTube only)
ru_ru: Включить автоматически созданные субтитры (только для YouTube)

source: Embed subtitles into video file
ru_ru: Вставить субтитры в видеофайл

source: Download subtitles only (do not include audio and video)
ru_ru: Загружать только субтитры (без аудио и видео)

source: Write in the text field on the side, one or more language codes of the subtitles to download separated by commas, e.g. "en, ja, ar" for English, Japanese and Arabic respectively. You can use regex (regular expression), e.g. "en.*, ja, ar.*" where the asterisk preceded by the dot will allow you to download everything related to the subtitles of a certain language. You can prefix the language code with a "-" to exclude it from the requested languages, e.g. "all, -it.*, -nl.*", -fr.*" will download all subtitles except those in Italian, Dutch and French.
ru_ru: Введите в текстовом поле сбоку один или несколько языковых кодов субтитров, которые нужно загрузить, через запятую, например: «en, ja, ar» для английского, японского и арабского языков соответственно. Вы можете использовать regex (регулярное выражение), например. «en.*, ja, ar.*», где перед звездочкой стоит точка, позволит вам скачать все, что связано с субтитрами на определенном языке. Вы можете добавить к коду языка префикс «-», чтобы исключить его из запрошенных языков, например «all, -it.*, -nl.*», -fr.*» загрузит все субтитры, кроме итальянских, голландских и французских.

source: Import queue file
ru_ru: Импортировать файл очереди(.json)

source: Replace occurrences with items from the imported queue.
ru_ru: Замените вхождения элементами из импортированной очереди.

source: Remove the current queue and replace it with the imported one.
ru_ru: Удалите текущую очередь и замените ее импортированной.
